In [1]:
import pandas as pd

In [11]:
dict1 ={'Name':['Avanee','Sejal','Shravan','Anisha','Saee',
                'Abhi','Dhiman'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Female','Female','Male','Female','Female',
                         'Female','Male']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0   Avanee     98  Female
1    Sejal     89  Female
2  Shravan     99    Male
3   Anisha     87  Female
4     Saee     90  Female
5     Abhi     83  Female
6   Dhiman     99    Male

In [3]:
#1. Display top 3 rows of the dataset 

df1.head(3)

      Name  Marks  Gender
0   Avanee     98  Female
1    Sejal     89  Female
2  Shravan     99    Male

In [4]:
#2. Check last 3 rows of the dataset 

df1.tail(3)

     Name  Marks  Gender
4    Saee     90  Female
5    Abhi     83  Female
6  Dhiman     99   Mmale

In [5]:
#3. & 4. Find shape of our dataset(No.of rows and colums) and info

df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [6]:
df1.shape

(7, 3)

In [8]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 7
Number of Columns 3

In [7]:
#5. Check the null values in the dataset 

df1.isnull().sum(axis =1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [12]:
#6. Check overall statistics about the dataframe

df1.describe(include = 'all')

          Name      Marks  Gender
count        7   7.000000       7
unique       7        NaN       2
top     Avanee        NaN  Female
freq         1        NaN       5
mean       NaN  92.142857     NaN
std        NaN   6.491753     NaN
min        NaN  83.000000     NaN
25%        NaN  88.000000     NaN
50%        NaN  90.000000     NaN
75%        NaN  98.500000     NaN
max        NaN  99.000000     NaN

In [9]:
#7. Find unique values from the gender column 
df1

      Name  Marks  Gender
0   Avanee     98  Female
1    Sejal     89  Female
2  Shravan     99    Male
3   Anisha     87  Female
4     Saee     90  Female
5     Abhi     83  Female
6   Dhiman     99   Mmale

In [13]:
df1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [14]:
#8. find the number/count of unique values from gender columns
df1['Gender'].nunique()

2

In [15]:
#9. Display count of unique values in gender column 

df1['Gender'].value_counts()

Gender
Female    5
Male      2
Name: count, dtype: int64

In [16]:
#10. Find total no.of students of having marks between 90 to 100 inclusive, using between method

df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [19]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [20]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [25]:
sum(df1['Marks'].between(90,100))

4

In [17]:
#11: Average marks 

df1['Marks'].mean()

92.14285714285714

In [18]:
#12(a) Apply method 

def marks(x):
    return x/2

In [29]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [19]:
df1

      Name  Marks  Gender
0   Avanee     98  Female
1    Sejal     89  Female
2  Shravan     99    Male
3   Anisha     87  Female
4     Saee     90  Female
5     Abhi     83  Female
6   Dhiman     99    Male

In [20]:
#12(b) applying lambda function to solve code in one line instead of the above used 3 lines of code.

df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [32]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [21]:
#13: Map function - convert male to 1 and female to 0 
df1

      Name  Marks  Gender
0   Avanee     98  Female
1    Sejal     89  Female
2  Shravan     99    Male
3   Anisha     87  Female
4     Saee     90  Female
5     Abhi     83  Female
6   Dhiman     99    Male

In [23]:
df1['Gender'].map({'Male':1, 'Female':0})

0    0
1    0
2    1
3    0
4    0
5    0
6    1
Name: Gender, dtype: int64

In [24]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})
df1

      Name  Marks  Gender  Male_Female
0   Avanee     98  Female            0
1    Sejal     89  Female            0
2  Shravan     99    Male            1
3   Anisha     87  Female            0
4     Saee     90  Female            0
5     Abhi     83  Female            0
6   Dhiman     99    Male            1

In [25]:
#14 : Drop the cloumns - single column at a time
df1.drop('Male_Female', axis=1)

      Name  Marks  Gender
0   Avanee     98  Female
1    Sejal     89  Female
2  Shravan     99    Male
3   Anisha     87  Female
4     Saee     90  Female
5     Abhi     83  Female
6   Dhiman     99    Male

In [26]:
#15 Print name of the columns 
df1.columns

Index(['Name', 'Marks', 'Gender', 'Male_Female'], dtype='object')

In [27]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [28]:
#16 Sort the dataframe as per marks column ASC/DESC 

df1.sort_values(by='Marks', ascending = False)

      Name  Marks  Gender  Male_Female
2  Shravan     99    Male            1
6   Dhiman     99    Male            1
0   Avanee     98  Female            0
4     Saee     90  Female            0
1    Sejal     89  Female            0
3   Anisha     87  Female            0
5     Abhi     83  Female            0

In [29]:
#17 Display name & marks of the female students 

df1

      Name  Marks  Gender  Male_Female
0   Avanee     98  Female            0
1    Sejal     89  Female            0
2  Shravan     99    Male            1
3   Anisha     87  Female            0
4     Saee     90  Female            0
5     Abhi     83  Female            0
6   Dhiman     99    Male            1

In [30]:
df1[df1['Gender']=='Female'][['Name', 'Marks']]

     Name  Marks
0  Avanee     98
1   Sejal     89
3  Anisha     87
4    Saee     90
5    Abhi     83

In [31]:
#with pandas dataframe 

df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

     Name  Marks
0  Avanee     98
1   Sejal     89
3  Anisha     87
4    Saee     90
5    Abhi     83